name: "tftrt_fp16"
platform: "tensorflow_savedmodel"
max_batch_size: 64
input {
    name: "input"
    data_type: TYPE_FP32
    format: FORMAT_NHWC
    dims: [ 224, 224, 3 ]
}
output {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: 1000
    label_filename: "imagenet1k_labels.txt"
}
default_model_filename: "model"
instance_group [
    {
        count: 1
        kind: KIND_GPU
    }
]
dynamic_batching {
    preferred_batch_size: [ 64 ]
    max_queue_delay_microseconds: 20000
}
